<div class="alert alert-block alert-info" style="margin-top: 20px">
    <a href="https://cocl.us/PY0101EN_edx_add_top">
         <img src="https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Ad/TopAd.png" width="750" align="center">
    </a>
</div>

<a href="https://cognitiveclass.ai/">
    <img src="https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Ad/CCLog.png" width="200" align="center">
</a>

<h1>Introduction to Pandas Python</h1>

<p><strong>Welcome!</strong> This notebook will teach you about using <code>Pandas</code> in the Python Programming Language. By the end of this lab, you'll know how to use <code>Pandas</code> package to view and access data.</p>

<h2>Table of Contents</h2>
<div class="alert alert-block alert-info" style="margin-top: 20px">
    <ul>
        <li><a href="dataset">About the Dataset</a></li>
        <li><a href="pandas">Introduction of <code>Pandas</code></a></li>
        <li><a href="data">Viewing Data and Accessing Data</a></li>
        <li><a href="quiz">Quiz on DataFrame</a></li>
    </ul>
    <p>
        Estimated time needed: <strong>15 min</strong>
    </p>
</div>

<hr>

<h2 id="dataset">About the Dataset</h2>

The table has one row for each album and several columns

<ul>
    <li><b>artist</b>: Name of the artist</li>
    <li><b>album</b>: Name of the album</li>
    <li><b>released_year</b>: Year the album was released</li>
    <li><b>length_min_sec</b>: Length of the album (hours,minutes,seconds)</li>
    <li><b>genre</b>: Genre of the album</li>
    <li><b>music_recording_sales_millions</b>: Music recording sales (millions in USD) on <a href="http://www.song-database.com/">[SONG://DATABASE]</a></li>
    <li><b>claimed_sales_millions</b>: Album's claimed sales (millions in USD) on <a href="http://www.song-database.com/">[SONG://DATABASE]</a></li>
    <li><b>date_released</b>: Date on which the album was released</li>
    <li><b>soundtrack</b>: Indicates if the album is the movie soundtrack (Y) or (N)</li>
    <li><b>rating_of_friends</b>: Indicates the rating from your friends from 1 to 10</li>
</ul>

You can see the dataset here:

<font size="1">
<table font-size:xx-small style="width:100%">
  <tr>
    <th>Artist</th>
    <th>Album</th> 
    <th>Released</th>
    <th>Length</th>
    <th>Genre</th> 
    <th>Music recording sales (millions)</th>
    <th>Claimed sales (millions)</th>
    <th>Released</th>
    <th>Soundtrack</th>
    <th>Rating (friends)</th>
  </tr>
  <tr>
    <td>Michael Jackson</td>
    <td>Thriller</td> 
    <td>1982</td>
    <td>00:42:19</td>
    <td>Pop, rock, R&B</td>
    <td>46</td>
    <td>65</td>
    <td>30-Nov-82</td>
    <td></td>
    <td>10.0</td>
  </tr>
  <tr>
    <td>AC/DC</td>
    <td>Back in Black</td> 
    <td>1980</td>
    <td>00:42:11</td>
    <td>Hard rock</td>
    <td>26.1</td>
    <td>50</td>
    <td>25-Jul-80</td>
    <td></td>
    <td>8.5</td>
  </tr>
    <tr>
    <td>Pink Floyd</td>
    <td>The Dark Side of the Moon</td> 
    <td>1973</td>
    <td>00:42:49</td>
    <td>Progressive rock</td>
    <td>24.2</td>
    <td>45</td>
    <td>01-Mar-73</td>
    <td></td>
    <td>9.5</td>
  </tr>
    <tr>
    <td>Whitney Houston</td>
    <td>The Bodyguard</td> 
    <td>1992</td>
    <td>00:57:44</td>
    <td>Soundtrack/R&B, soul, pop</td>
    <td>26.1</td>
    <td>50</td>
    <td>25-Jul-80</td>
    <td>Y</td>
    <td>7.0</td>
  </tr>
    <tr>
    <td>Meat Loaf</td>
    <td>Bat Out of Hell</td> 
    <td>1977</td>
    <td>00:46:33</td>
    <td>Hard rock, progressive rock</td>
    <td>20.6</td>
    <td>43</td>
    <td>21-Oct-77</td>
    <td></td>
    <td>7.0</td>
  </tr>
    <tr>
    <td>Eagles</td>
    <td>Their Greatest Hits (1971-1975)</td> 
    <td>1976</td>
    <td>00:43:08</td>
    <td>Rock, soft rock, folk rock</td>
    <td>32.2</td>
    <td>42</td>
    <td>17-Feb-76</td>
    <td></td>
    <td>9.5</td>
  </tr>
    <tr>
    <td>Bee Gees</td>
    <td>Saturday Night Fever</td> 
    <td>1977</td>
    <td>1:15:54</td>
    <td>Disco</td>
    <td>20.6</td>
    <td>40</td>
    <td>15-Nov-77</td>
    <td>Y</td>
    <td>9.0</td>
  </tr>
    <tr>
    <td>Fleetwood Mac</td>
    <td>Rumours</td> 
    <td>1977</td>
    <td>00:40:01</td>
    <td>Soft rock</td>
    <td>27.9</td>
    <td>40</td>
    <td>04-Feb-77</td>
    <td></td>
    <td>9.5</td>
  </tr>
</table></font>

<hr>

<h2 id="pandas">Introduction of <code>Pandas</code></h2>

In [22]:
# Dependency needed to install file 

!pip install xlrd

/opt/conda/envs/Python-3.7-main/lib/python3.7/site-packages/secretstorage/dhcrypto.py:16: CryptographyDeprecationWarning: int_from_bytes is deprecated, use int.from_bytes instead
  from cryptography.utils import int_from_bytes
/opt/conda/envs/Python-3.7-main/lib/python3.7/site-packages/secretstorage/util.py:25: CryptographyDeprecationWarning: int_from_bytes is deprecated, use int.from_bytes instead
  from cryptography.utils import int_from_bytes
Requirement already satisfied: xlrd in /opt/conda/envs/Python-3.7-main/lib/python3.7/site-packages (1.2.0)

In [23]:
# Import required library

import pandas as pd

After the import command, we now have access to a large number of pre-built classes and functions. This assumes the library is installed; in our lab environment all the necessary libraries are installed. One way pandas allows you to work with data is a dataframe. Let's go through the process to go from a comma separated values (<b>.csv</b>) file to a dataframe. This variable <code>csv_path</code> stores the path of the <b>.csv</b>, that is  used as an argument to the <code>read_csv</code> function. The result is stored in the object <code>df</code>, this is a common short form used for a variable referring to a Pandas dataframe.

In [24]:
# Read data from CSV file

csv_path = 'https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Chapter%204/Datasets/TopSellingAlbums.csv'
df = pd.read_csv(csv_path)

We can use the method <code>head()</code> to examine the first five rows of a dataframe:

In [26]:
# Print first five rows of the dataframe

df.head()

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,0:42:19,"pop, rock, R&B",46.0,65,30-Nov-82,NaN,10.0
1,AC/DC,Back in Black,1980,0:42:11,hard rock,26.1,50,25-Jul-80,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,0:42:49,progressive rock,24.2,45,01-Mar-73,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,0:57:44,"R&B, soul, pop",27.4,44,17-Nov-92,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,0:46:33,"hard rock, progressive rock",20.6,43,21-Oct-77,NaN,8.0

In [51]:
df.shape

(8, 10)

In [52]:
df.size

80

 We use the path of the excel file and the function <code>read_excel</code>. The result is a data frame as before:

In [27]:
# Read data from Excel File and print the first five rows

xlsx_path = 'https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Chapter%204/Datasets/TopSellingAlbums.xlsx'

df = pd.read_excel(xlsx_path)
df.head()

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,00:42:19,"pop, rock, R&B",46.0,65,1982-11-30,NaN,10.0
1,AC/DC,Back in Black,1980,00:42:11,hard rock,26.1,50,1980-07-25,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,00:42:49,progressive rock,24.2,45,1973-03-01,NaN,9.0
3,Whitney Houston,The Bodyguard,1992,00:57:44,"R&B, soul, pop",27.4,44,1992-11-17,Y,8.5
4,Meat Loaf,Bat Out of Hell,1977,00:46:33,"hard rock, progressive rock",20.6,43,1977-10-21,NaN,8.0

We can access the column <b>Length</b> and assign it a new dataframe <b>x</b>:

In [28]:
# Access to the column Length

x = df[['Length']]
x

     Length
0  00:42:19
1  00:42:11
2  00:42:49
3  00:57:44
4  00:46:33
5  00:43:08
6  01:15:54
7  00:40:01

 The process is shown in the figure:

<img src="https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Chapter%204/Images/DataEgOne.png" width="750" />

<hr>

<h2 id="data">Viewing Data and Accessing Data</h2>

You can also get a column as a series. You can think of a Pandas series as a 1-D dataframe. Just use one bracket:

In [29]:
# Get the column as a series

x = df['Length']
x

0    00:42:19
1    00:42:11
2    00:42:49
3    00:57:44
4    00:46:33
5    00:43:08
6    01:15:54
7    00:40:01
Name: Length, dtype: object

In [30]:
type(df['Length'])

pandas.core.series.Series

You can also get a column as a dataframe. For example, we can assign the column <b>Artist</b>:

In [31]:
# Get the column as a dataframe

x = type(df[['Artist']])
x

pandas.core.frame.DataFrame

In [32]:
x = df['Artist']
x

0    Michael Jackson
1              AC/DC
2         Pink Floyd
3    Whitney Houston
4          Meat Loaf
5             Eagles
6           Bee Gees
7      Fleetwood Mac
Name: Artist, dtype: object

You can do the same thing for multiple columns; we just put the dataframe name, in this case, <code>df</code>, and the name of the multiple column headers enclosed in double brackets. The result is a new dataframe comprised of the specified columns:

In [33]:
# Access to multiple columns

y = df[['Artist','Length','Genre']]
y

            Artist    Length                        Genre
0  Michael Jackson  00:42:19               pop, rock, R&B
1            AC/DC  00:42:11                    hard rock
2       Pink Floyd  00:42:49             progressive rock
3  Whitney Houston  00:57:44               R&B, soul, pop
4        Meat Loaf  00:46:33  hard rock, progressive rock
5           Eagles  00:43:08   rock, soft rock, folk rock
6         Bee Gees  01:15:54                        disco
7    Fleetwood Mac  00:40:01                    soft rock

The process is shown in the figure:

<img src = "https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Chapter%204/Images/DataEgTwo.png" width="1100" />

__One way to access unique elements is the <code>.iloc</code> method, where you can access the 1st row and the 1st column as follows:__

In [34]:
# Access the value on the first row and the first column
#fetches single element, only uses numbers for indexing
df.iloc[0, 0]

'Michael Jackson'

In [37]:
# Access the value on the first row and the first column
#fetches multiple element as series, only uses numbers for indexing
df.iloc[0, 0:3]

Artist      Michael Jackson
Album              Thriller
Released               1982
Name: 0, dtype: object

In [45]:
type(df.iloc[0, 0:3])

pandas.core.series.Series

You can access the 2nd row and the 1st column as follows:

In [16]:
# Access the value on the second row and the first column

df.iloc[1,0]

'AC/DC'

You can access the 1st row and the 3rd column as follows:

In [17]:
# Access the value on the first row and the third column

df.iloc[0,2]

1982

In [40]:
df.iloc[0:2,0:2] #outputs dataframe

            Artist          Album
0  Michael Jackson       Thriller
1            AC/DC  Back in Black

In [46]:
type(df.iloc[0:2,0:2])

pandas.core.frame.DataFrame

In [42]:
df.iloc[0:2]  #outputs dataframe

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,00:42:19,"pop, rock, R&B",46.0,65,1982-11-30,NaN,10.0
1,AC/DC,Back in Black,1980,00:42:11,hard rock,26.1,50,1980-07-25,NaN,9.5

In [44]:
df.iloc[0,0:2]

Artist    Michael Jackson
Album            Thriller
Name: 0, dtype: object

In [47]:
df.iloc[0:2,2]

0    1982
1    1980
Name: Released, dtype: int64

__You can access the column using the name using <code>.loc</code>, the following are the same as above:__

In [18]:
# Access the column using the column name
#fetches single element, uses column name for indexing
df.loc[0, 'Artist']

'Michael Jackson'

In [38]:
#fetches multiple element, only uses numbers for indexing
df.loc[0, 'Artist':'Released']

Artist      Michael Jackson
Album              Thriller
Released               1982
Name: 0, dtype: object

In [19]:
# Access the column using the name

df.loc[1, 'Artist']

'AC/DC'

In [20]:
# Access the column using the name

df.loc[0, 'Released']

1982

In [21]:
# Access the column using the name

df.loc[1, 'Released']

1980

You can perform slicing using both the index and the name of the column:

In [30]:
# Slicing the dataframe using name

df.loc[0:2, 'Artist':'Released']

            Artist                      Album  Released
0  Michael Jackson                   Thriller      1982
1            AC/DC              Back in Black      1980
2       Pink Floyd  The Dark Side of the Moon      1973

In [33]:

df.loc[0:2]

,Artist,Album,Released,Length,Genre,Music Recording Sales (millions),Claimed Sales (millions),Released.1,Soundtrack,Rating
0,Michael Jackson,Thriller,1982,00:42:19,"pop, rock, R&B",46.0,65,1982-11-30,NaN,10.0
1,AC/DC,Back in Black,1980,00:42:11,hard rock,26.1,50,1980-07-25,NaN,9.5
2,Pink Floyd,The Dark Side of the Moon,1973,00:42:49,progressive rock,24.2,45,1973-03-01,NaN,9.0

In [53]:
# The code was removed by Watson Studio for sharing.

In [54]:
#shows rows x Coloumns
df_data_1.shape

(50, 12)

In [55]:
#shows total elements
df_data_1.size

600

In [56]:
#displays first five rows and columns
df_data_1.head()

,Rank,Title,Description,Runtime,Genre,Rating,Metascore,Votes,Gross_Earning_in_Mil,Director,Actor,Year
0,1,The Shawshank Redemption,Two imprisoned men bond over a number of years...,142,Crime,9.3,80.0,1934970,28.34,Frank Darabont,Tim Robbins,1994
1,2,The Godfather,The aging patriarch of an organized crime dyna...,175,Crime,9.2,100.0,1323670,134.97,Francis Ford Coppola,Marlon Brando,1972
2,3,The Dark Knight,When the menace known as the Joker emerges fro...,152,Action,9.0,82.0,1905413,534.86,Christopher Nolan,Christian Bale,2008
3,4,The Godfather: Part II,The early life and career of Vito Corleone in ...,202,Crime,9.0,85.0,914854,57.30,Francis Ford Coppola,Al Pacino,1974
4,5,Pulp Fiction,"The lives of two mob hitmen, a boxer, a gangst...",154,Crime,8.9,94.0,1511653,107.93,Quentin Tarantino,John Travolta,1994

In [57]:
#creating a new dataframe X1
x1=df_data_1[["Title"]]
x1

                                                Title
0                            The Shawshank Redemption
1                                       The Godfather
2                                     The Dark Knight
3                              The Godfather: Part II
4                                        Pulp Fiction
5                                    Schindler's List
6       The Lord of the Rings: The Return of the King
7                     Il buono, il brutto, il cattivo
8                                        12 Angry Men
9                                           Inception
10  The Lord of the Rings: The Fellowship of the Ring
11                                       Forrest Gump
12                                         Fight Club
13     Star Wars: Episode V - The Empire Strikes Back
14                                         Goodfellas
15                                         The Matrix
16              The Lord of the Rings: The Two Towers
17                    One Flew Over the Cuckoo's Nest
18                               Shichinin no samurai
19                                       Interstellar
20                                               Léon
21                           The Silence of the Lambs
22                                Saving Private Ryan
23                                              Se7en
24                                          Star Wars
25                                 The Usual Suspects
26                      Sen to Chihiro no kamikakushi
27                                     Cidade de Deus
28                                             Dangal
29                                    La vita è bella
30                              It's a Wonderful Life
31                                        City Lights
32                                               Coco
33                                      The Lion King
34                                     The Green Mile
35                                          Gladiator
36                                       The Departed
37                                 Back to the Future
38                                       The Prestige
39                            Raiders of the Lost Ark
40                                             Psycho
41                                           Whiplash
42                                              Alien
43                                     Apocalypse Now
44                                            Memento
45                                 American History X
46                         Terminator 2: Judgment Day
47                                   The Intouchables
48                                        The Pianist
49                                         Casablanca

In [59]:
type(x1)

pandas.core.frame.DataFrame

In [61]:
#Creating a new Series of 1-D Dataframe
x2=df_data_1["Title"]
x2

0                              The Shawshank Redemption
1                                         The Godfather
2                                       The Dark Knight
3                                The Godfather: Part II
4                                          Pulp Fiction
5                                      Schindler's List
6         The Lord of the Rings: The Return of the King
7                       Il buono, il brutto, il cattivo
8                                          12 Angry Men
9                                             Inception
10    The Lord of the Rings: The Fellowship of the Ring
11                                         Forrest Gump
12                                           Fight Club
13       Star Wars: Episode V - The Empire Strikes Back
14                                           Goodfellas
15                                           The Matrix
16                The Lord of the Rings: The Two Towers
17                      One Flew Over the Cuckoo's Nest
18                                 Shichinin no samurai
19                                         Interstellar
20                                                 Léon
21                             The Silence of the Lambs
22                                  Saving Private Ryan
23                                                Se7en
24                                            Star Wars
25                                   The Usual Suspects
26                        Sen to Chihiro no kamikakushi
27                                       Cidade de Deus
28                                               Dangal
29                                      La vita è bella
30                                It's a Wonderful Life
31                                          City Lights
32                                                 Coco
33                                        The Lion King
34                                       The Green Mile
35                                            Gladiator
36                                         The Departed
37                                   Back to the Future
38                                         The Prestige
39                              Raiders of the Lost Ark
40                                               Psycho
41                                             Whiplash
42                                                Alien
43                                       Apocalypse Now
44                                              Memento
45                                   American History X
46                           Terminator 2: Judgment Day
47                                     The Intouchables
48                                          The Pianist
49                                           Casablanca
Name: Title, dtype: object

In [62]:
type(x2)

pandas.core.series.Series

In [64]:
#refers the 0th row, 1st coloumn element, output is a series
#iloc only uses index numbers for reference
df_data_1.iloc[0,1]

'The Shawshank Redemption'

In [65]:
#refers the entire 0th row and 1st row(n-1) as a dataframe
df_data_1.iloc[0:2]

,Rank,Title,Description,Runtime,Genre,Rating,Metascore,Votes,Gross_Earning_in_Mil,Director,Actor,Year
0,1,The Shawshank Redemption,Two imprisoned men bond over a number of years...,142,Crime,9.3,80.0,1934970,28.34,Frank Darabont,Tim Robbins,1994
1,2,The Godfather,The aging patriarch of an organized crime dyna...,175,Crime,9.2,100.0,1323670,134.97,Francis Ford Coppola,Marlon Brando,1972

In [70]:
#2x2 dataframe
df_data_1.iloc[0:3,4:7]

    Genre  Rating  Metascore
0   Crime     9.3       80.0
1   Crime     9.2      100.0
2  Action     9.0       82.0

In [17]:
#refers the 0th row, Genre coloumn element, output is a series (equivlanebt to iloc[0,4])
#loc only uses coloumn name for reference
df_data_1.loc[0,"Genre"]

'Crime'

In [67]:
#refers the first 4 rows and selected columns Note: (n-1 not used, since index refreneced with column names)
#iloc only uses index numbers for reference
df_data_1.loc[0:3,"Genre":"Votes"]

    Genre  Rating  Metascore    Votes
0   Crime     9.3       80.0  1934970
1   Crime     9.2      100.0  1323670
2  Action     9.0       82.0  1905413
3   Crime     9.0       85.0   914854

<h2 id="quiz">Quiz on DataFrame</h2>

Use a variable <code>q</code> to store the column <b>Rating</b> as a dataframe

In [72]:
# Write your code below and press Shift+Enter to execute
q=df[["Rating"]]
q

   Rating
0    10.0
1     9.5
2     9.0
3     8.5
4     8.0
5     7.5
6     7.0
7     6.5

Double-click __here__ for the solution.

<!-- Your answer is below:
q = df[['Rating']]
q
-->

Assign the variable <code>q</code> to the dataframe that is made up of the column <b>Released</b> and <b>Artist</b>:

In [75]:
# Write your code below and press Shift+Enter to execute
q = df[["Released","Artist"]]
q

   Released           Artist
0      1982  Michael Jackson
1      1980            AC/DC
2      1973       Pink Floyd
3      1992  Whitney Houston
4      1977        Meat Loaf
5      1976           Eagles
6      1977         Bee Gees
7      1977    Fleetwood Mac

Double-click __here__ for the solution.

<!-- Your answer is below:
q = df[['Released', 'Artist']]
q
-->

Access the 2nd row and the 3rd column of <code>df</code>:

In [78]:
# Write your code below and press Shift+Enter to execute
#.iloc (n-1)
df.iloc[1,2]

1980

Double-click __here__ for the solution.

<!-- Your answer is below:
df.iloc[1, 2]
-->

<hr>
<h2>The last exercise!</h2>
<p>Congratulations, you have completed your first lesson and hands-on lab in Python. However, there is one more thing you need to do. The Data Science community encourages sharing work. The best way to share and showcase your work is to share it on GitHub. By sharing your notebook on GitHub you are not only building your reputation with fellow data scientists, but you can also show it off when applying for a job. Even though this was your first piece of work, it is never too early to start building good habits. So, please read and follow <a href="https://cognitiveclass.ai/blog/data-scientists-stand-out-by-sharing-your-notebooks/" target="_blank">this article</a> to learn how to share your work.
<hr>

<div class="alert alert-block alert-info" style="margin-top: 20px">
<h2>Get IBM Watson Studio free of charge!</h2>
    <p><a href="https://cocl.us/PY0101EN_edx_add_bbottom"><img src="https://s3-api.us-geo.objectstorage.softlayer.net/cf-courses-data/CognitiveClass/PY0101EN/Ad/BottomAd.png" width="750" align="center"></a></p>
</div>

<h3>About the Authors:</h3>  
<p><a href="https://www.linkedin.com/in/joseph-s-50398b136/" target="_blank">Joseph Santarcangelo</a> is a Data Scientist at IBM, and holds a PhD in Electrical Engineering. His research focused on using Machine Learning, Signal Processing, and Computer Vision to determine how videos impact human cognition. Joseph has been working for IBM since he completed his PhD.</p>

Other contributors: <a href="www.linkedin.com/in/jiahui-mavis-zhou-a4537814a">Mavis Zhou</a>

<hr>

<p>Copyright &copy; 2018 IBM Developer Skills Network. This notebook and its source code are released under the terms of the <a href="https://cognitiveclass.ai/mit-license/">MIT License</a>.</p>